Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ide-omegat.tmx
Source language: en_us
Languages: pt_br

source: The user directory location is listed under User Dir in the Details tab.
pt_br: A localização do diretório de usuário está listada em "Dir. do Usuário" na aba "Detalhes".

source: Settings imported successfully.
pt_br: Configurações importadas com sucesso.

source: The import procedure has failed.
pt_br: O procedimento de importação falhou.

source: Done.
pt_br: Pronto.

source: Importing ...
pt_br: Importando ...

source: Import Settings Status:
pt_br: Estado da importação de configurações:

source: Browse...
pt_br: Procurar...

source: Settings Import Wizard
pt_br: Assistente de importação de configurações

source: Importing old settings ...
pt_br: Importando configurações antigas ...

source: Exit IDE
pt_br: Sair do IDE

source: E
pt_br: r

source: Start IDE
pt_br: Iniciar o IDE

source: S
pt_br: c

source: Import
pt_br: Importar

source: Do you wish to import settings from a previous installation?
pt_br: Deseja importar as configurações de uma instalação anterior?

source: Do you need to import settings?
pt_br: Precisa importar as configurações?

source: Yes, please import my settings from the previous version.
pt_br: Sim, favor importar minhas configurações da versão anterior.

source: No, skip the settings import.
pt_br: Não, ignore a importação das configurações.

source: Note: It is not possible to import settings at a later time.
pt_br: Nota: Não é possível importar configurações em um momento posterior.

source: This wizard lets you import your IDE environment and settings from previous versions of the IDE.
pt_br: Este assistente permite importar seu ambiente e configurações de uma versão anterior do IDE.

source: System recovered successfully.
pt_br: Recuperação do sistema bem-sucedida.

source: Import failed, recovery started.
pt_br: A importação falhou, recuperação iniciada.

source: Import Settings
pt_br: Importação das configurações

source: Locate Previous IDE
pt_br: Encontrar IDE anterior

source: Previous IDE:
pt_br: IDE anterior:

source: P
pt_br: a

source: You did not select a valid IDE directory or the version of the IDE is unknown.
pt_br: Você não selecionou um diretório válido do IDE ou a versão do IDE é desconhecida.

source: Select Previous IDE Location
pt_br: Selecione a localização do IDE anterior

source: Open
pt_br: Abrir

source: Y
pt_br: S

source: Result status
pt_br: Status do resultado

source: Status of IDE settings import.
pt_br: Situação da importação das configurações do IDE.

source: Import settings status
pt_br: Estado da importação de configurações

source: Directory {0} can not be found or mounted.
pt_br: O diretório {0} não pôde ser encontrado ou montado.

source: Were any of these IDEs previously installed on this system?
pt_br: Alguma destas IDEs estava previamente instalado em seu sistema?

source: Yes, other versions of the IDE were installed on this system
pt_br: Sim, outras versões do IDE estavam instalado neste sistema

source: No, none of the above versions were previously installed on this system
pt_br: Não, nenhuma das versões acima estava instalada neste sistema

source: NetBeans software (3.5.x, 3.4.x, 3.3.x, 3.2.x, 3.1 or 3.0 releases) Forte for Java software (4.0, 3.0 or 2.0 releases) Sun ONE Studio 4 update 1 software
pt_br: Software NetBeans (versões 3.5.x, 3.4.x, 3.3.x, 3.2.x, 3.1 ou 3.0) Software Forte for Java (versões 4.0, 3.0 ou 2.0) Software Sun ONE Studio 4 update 1

source: Are you a returning user?
pt_br: Você é um usuário recorrente?

source: Settings created by a previous version of the IDE were found on your system at {0}.
pt_br: As configurações criadas por uma versão anterior do IDE foram encontradas no seu sistema em {0}.

source: Do you want to import them?
pt_br: Deseja importá-las?

source: Confirm Import Settings
pt_br: Confirmação de importação de configurações

source: Start &Page
pt_br: &Página inicial

source: Start Page
pt_br: Página inicial

source: Welcome window providing basic information about IDE.
pt_br: A janela de boas-vindas fornece informações básicas sobre o IDE.

source: Shows welcome content after the first startup of the IDE.
pt_br: Mostra conteúdo de boas-vindas após a primeira inicialização do IDE.

source: The Welcome module provides a screen with introductory information about using the IDE.
pt_br: O módulo de boas-vindas fornece uma tela introdutória com informações sobre como utilizar o IDE.

source: The screen appears when you start the IDE for the first time.
pt_br: A tela aparece quando você inicia o IDE pela primeira vez.

source: You can choose basic commands and open help topics directly from this screen.
pt_br: Você pode escolher comandos básicos e abrir tópicos de ajuda diretamente a partir desta tela.

source: Welcome Screen
pt_br: Tela de boas-vindas

source: Help
pt_br: Ajuda

source: Do you want to participate in NetBeans Users Satisfaction Survey now?
pt_br: Deseja participar do programa de satisfação do usuário NetBeans agora?

source: NetBeans Users Satisfaction Survey
pt_br: Programa de satisfação do usuário NetBeans

source: Go to Survey
pt_br: Ir para o programa

source: Remind Later
pt_br: Lembre-me mais tarde

source: Quick Start Tutorial
pt_br: Guia de início rápido

source: What's New
pt_br: O que há de novo

source: Take a Tour
pt_br: Faça um tour

source: General Java Programming
pt_br: Programação Java em geral

source: Swing GUIs
pt_br: GUIs Swing

source: Web Apps
pt_br: Aplicações web

source: Mobile Apps
pt_br: Aplicações móveis

source: UML Modeling
pt_br: Modelagem UML

source: More Demos and Tutorials >>
pt_br: Mais demonstrações e tutoriais >>

source: Open default web browser with documentation to learn more about {0}
pt_br: Abrir o navegador web padrão com a documentação para aprender mais sobre {0}

source: ARTICLES & NEWS
pt_br: ARTIGOS & NOVIDADES

source: ALL NEWS >>
pt_br: TODAS AS NOVIDADES >>

source: Show all news
pt_br: Exibir todas as novidades

source: Open the list of all news articles in the default web browser
pt_br: Abrir a lista de todas as notícias no navegador web padrão

source: ALL ARTICLES >>
pt_br: TODOS OS ARTIGOS >>

source: Show all articles
pt_br: Exibir todos os artigos

source: Open the list of all articles in the default web browser
pt_br: Abrir a lista de todos os artigos no navegador web padrão

source: ALL BLOGS >>
pt_br: TODOS OS BLOGS >>

source: Show all blogs
pt_br: Exibir todos os blogs

source: Open the list of all blogs in the default web browser
pt_br: Abrir a lista de todos os blogs no navegador web padrão

source: ALL DEMOS >>
pt_br: TODAS AS DEMONSTRAÇÕES >>

source: Show all demos
pt_br: Exibir todas as demonstrações

source: Open the list of all demos in the default web browser
pt_br: Abrir a lista de todas as demonstrações no navegador web padrão

source: Create a new sample project for {0}
pt_br: Criar um novo projeto de exemplo para {0}

source: Open default web browser with documentation to get started with {0}
pt_br: Abrir o navegador web padrão para começar com {0}

source: Web link to {0}
pt_br: Link web para {0}

source: Open URL {0} in the default browser
pt_br: Abrir a URL {0} no navegador padrão

source: Show On Startup
pt_br: Exibir ao iniciar

source: Show Welcome Screen on startup
pt_br: Mostrar a tela de boas-vindas na inicialização

source: Checkbox to show or hide the Welcome Screen on next NetBeans startup
pt_br: Caixa de seleção para mostrar ou ocultar a tela de boas-vindas na próxima inicialização do NetBeans

source: Content is loading...
pt_br: Carregando conteúdo...

source: Error while loading content
pt_br: Erro ao carregar o conteúdo

source: Cannot connect to internet.
pt_br: Não é possível conectar-se a internet.

source: &Proxy Configuration...
pt_br: &Configuração de proxy...

source: Reload
pt_br: Recarregar

source: My NetBeans
pt_br: Meu NetBeans

source: Get Started
pt_br: Primeiros passos

source: Try a Sample Project
pt_br: Experimente um projeto de exemplo

source: Extend Your IDE
pt_br: Extender seu IDE

source: Learn More About
pt_br: Saiba mais sobre

source: Recent Projects
pt_br: Projetos recentes

source: Featured Demo
pt_br: Demonstração em destaque

source: News & Tutorials
pt_br: Notícias & tutoriais

source: Add more tools into NetBeans IDE delivered by NetBeans team for Desktop, Web, Enterprise, Mobile Java development and Ruby, C/C++, SOA, UML development.
pt_br: Adicionar mais ferramentas ao NetBeans IDE emitidas pela equipe do NetBeans equipe para desenvolvimento Desktop, Web, Enterprise e Mobile em Java e desenvolvimento Ruby, C/C++, SOA e UML.

source: Plus many third party plugins for enhanced productivity.
pt_br: Adicione muitos plugins de terceiros para aumentar a produtividade.

source: <no screen shot available>
pt_br: <nenhuma captura de tela disponível>

source: <no recent project>
pt_br: <nenhum projeto recente>

source: Open recent project: {0}
pt_br: Abrir projeto recente: {0}

source: Add Plugins >>
pt_br: Adicionar plugins >>

source: GUI Form Examples
pt_br: Exemplos de Formulários GUI

source: GUI Form Example Descriptions
pt_br: Descrição de exemplos de formulários GUI

source: This project contains three visual forms that were designed with the IDE's GUI Builder.
pt_br: Este projecto inclui três formulários visuais, que foram feitos com o construtor de GUI do IDE.

source: You can open these forms in the IDE, and you can view accompanying demos that show you how those forms can be created in the IDE.
pt_br: Você pode abrir estes formulários no IDE, e ver que acompanham as demonstrações que mostram como os formulários podem ser criados no IDE.

source: To open an example form in the GUI Builder:
pt_br: Para abrir um formulário de exemplo no construtor de GUI:

source: In the IDE's Projects window, navigate to the default package node within the
pt_br: Na janela de projeto do IDE, navegue até o nó do pacote padrão dentro do

source: Source Packages directory.
pt_br: Diretório de pacotes de código-fonte.

source: Double-click the node of the sample form you want to view.
pt_br: Dê um duplo clique no nó do exemplo de formulário que deseja exibir.

source: The IDE launches the GUI Builder and displays the chosen form.
pt_br: O IDE inicializa o construtor de GUI Builder e mostra o formulário escolhido.

source: Contact Editor
pt_br: Contactar redação

source: This complex form is similar to Windows dialogs typically used to display and edit database information.
pt_br: Este complexo formulário é semelhante às janelas de diálogo, tipicamente usadas para exibir e editar informações de bases de dados.

source: The example illustrates the full range of GUI Builder features, including alignment, anchoring, sizing, indentation, and runtime auto-resizing behavior.
pt_br: O exemplo ilustra todas as funcionalidades do contrutor de GUI, incluindo o alinhamento, ancoragem, tamanho, tabulação, e comportamento de auto-redimensionamento em tempo de execução.

source: To view a detailed tutorial including flash demonstrations showing how to build this form, see GUI Building in NetBeans IDE 5.0.
pt_br: Para visualizar um tutorial detalhado incluindo demonstrações em flash mostrando como construir este formulário, consulte Contruindo GUI no NetBeans IDE 5.0.

source: Antenna Preferences
pt_br: Preferências do Antenna

source: This example illustrates a type of table-based form commonly used to display related information in visually coherent groups.
pt_br: Este exemplo ilustra um tipo de tabela baseada em formulários comumente usados para exibir informações coerentes relacionadas visualmente em grupos.

source: The GUI Builder's advanced alignment features enable you to group and size non-adjacent components (such as labels, textfields, and buttons) consistently without the need to merge cells manually.
pt_br: As características avançadas de alinhamento do construtor de GUI lhe permitem agrupar e redimensionar componentes não adjacentes (tais como rótulos, campos de texto e botões) sem a necessidade de fundir células manualmente.

source: To view a flash demonstration showing how to build this form, see GUI Form Example: Antenna Preferences Dialog.
pt_br: Para ver uma demonstração em flash mostrando como construir este formulário, consulte Exemplo de formulário GUI: Diálogo de preferências Antenna.

source: Find
pt_br: Localizar

source: This simple form illustrates a straight-forward layout often used in various applications requiring basic search functionality.
pt_br: Este simples formulário ilustra um layout straight-forward, frequentemente utilizado em diversas aplicações que exijam funcionalidade de pesquisa básica.

source: The GUI Builder's alignment and sizing features enable you to quickly construct such forms while ensuring that they localize predictably.
pt_br: As características de alinhamento e redimensionamento do construtor de GUI lhe permitem rapidamente construir tais formas, assegurando que se localizem no mesmo local onde são colocadas.

source: To view a flash demonstration showing how to build this form, see GUI Form Example: Find Dialog.
pt_br: Para ver uma demonstração em flash mostrando como construir este formulário, consulte Exemplo de formulário GUI: Diálogo de pesquisa.

source: Getting Started with NetBeans IDE 6.0 Preview (Milestone 9)
pt_br: Começando com NetBeans IDE 6.0 Preview (Milestone 9)

source: This page contains pointers to NetBeans IDE documentation, both for the 5.5 and 6.0 versions of the IDE.
pt_br: Esta página contém referências para a documentação do NetBeans IDE, tanto para as versões 5.5 e 6.0 do IDE.

source: The NetBeans IDE 5.5 tutorials may not be entirely up-to-date with the current state of the NetBeans IDE 6.0 builds, but they should point you in the right direction.
pt_br: Os tutoriais do NetBeans IDE 5.5 podem não estar totalmente atualizados com o estado atual do NetBeans IDE 6.0, mas eles devem derecioná-lo para a direção certa.

source: For the latest stable release of NetBeans IDE, download NetBeans IDE 5.5.
pt_br: Para a última versão estável do NetBeans IDE, faça o download do NetBeans IDE 5.5.

source: Try It Out
pt_br: Experimentar

source: Run through the 15-minute Quick Start Guide to learn the basics of working with NetBeans IDE.
pt_br: Executar o guia de início rápido por 15 minutos para aprender os conceitos básicos de trabalho com o NetBeans IDE.

source: NetBeans IDE Quick Start Guide
pt_br: Guia de início rápido do NetBeans IDE

source: Learn More
pt_br: Saiba mais

source: To access our growing list of NetBeans IDE 6.0 tutorials and demos, go to:
pt_br: Para participar da nossa crescente lista de tutoriais e demonstrações do NetBeans IDE 6.0, vá para:

source: For NetBeans IDE 5.5 documentation, see:
pt_br: Para a documentação do NetBeans IDE 5.5, consulte:

source: Registration Library
pt_br: Biblioteca de registro

source: and
pt_br: e

source: NetBeans Integrated Development Environment 6.0.1
pt_br: NetBeans Ambiente de Desenvolvimento Integrado 6.0.1

source: Development Tools
pt_br: Ferramentas de desenvolvimento

source: Register your NetBeans IDE
pt_br: Registrar seu NetBeans IDE

source: Thank you for installing the @@PRODUCT@@.
pt_br: Obrigado por instalar o @@PRODUCT@@.

source: Registering your product will give you the following benefits:
pt_br: Registrando o seu produto obterá as seguintes vantagens:

source: Notification of new versions, patches, and updates
pt_br: Notificação de novas versões, patches e atualizações

source: Product registration is FREE, quick and easy!
pt_br: O registo do produto é GRATUITO, rápido e fácil!

source: All you need is a Sun Developer Network or other Sun Online account.
pt_br: Tudo o que você precisa é uma conta da Sun Developer Network ou outra conta Sun Online.

source: If you don't already have one, you will be prompted to create one.
pt_br: Se você não tiver uma, será solicitado a criá-la.

source: You need to be connected to the Internet to register this Sun product.
pt_br: Você precisa estar conectado à internet para registrar esse produto Sun.

source: respects your privacy.
pt_br: respeita sua privacidade.

source: We will use your personal information for communications and management of your Sun Online Account, the services and applications you access using your Sun Online Account, and the products you register with your Sun Online Account.
pt_br: Iremos utilizar suas informações pessoais para comunicações e gestão da sua conta Sun Online, os serviços e aplicações que utilizam o acesso a sua conta Sun Online, e os produtos com que você cadastrou em sua conta Sun Online.

source: For more information on the data that will be collected as part of the registration process and how it will be managed see https://sunconnection.sun.com/inventory/privacy.jsp.
pt_br: Para obter mais informações sobre os dados que serão recolhidos como parte do processo de inscrição e como serão gerenciados consulte https://sunconnection.sun.com/inventory/privacy.jsp.

source: For more information on Sun's Privacy Policy see http://www.sun.com/privacy/ or contact privacy@sun.com.
pt_br: Para obter mais informações sobre a Política de Privacidade da Sun consulte http://www.sun.com/privacy/ ou entre em contato com privacy@sun.com.
